case/demo/generateBoundary/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1;
        startFace       299;
    }
    upperWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1;
        startFace       300;
    }
    front
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          300;
        startFace       301;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  back;
    }
    back
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          300;
        startFace       601;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  front;
    }
    left
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          300;
        startFace       901;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  right;
    }
    right
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          300;
        startFace       1201;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  left;
    }
)

// ************************************************************************* //
