case/demo/generateBoundary/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include	"../../utilities/boundaryConditions"

Ubar            Ubar [0 1 -1 0 0 0 0] $uBar;

transportModel  Newtonian;

nu              nu [0 2 -1 0 0 0 0] 1.5e-05;

CrossPowerLawCoeffs
{
    nu0             nu0 [0 2 -1 0 0 0 0] 1e-06;
    nuInf           nuInf [0 2 -1 0 0 0 0] 1e-06;
    m               m [0 0 1 0 0 0 0] 1;
    n               n [0 0 0 0 0 0 0] 1;
}

BirdCarreauCoeffs
{
    nu0             nu0 [0 2 -1 0 0 0 0] 1e-06;
    nuInf           nuInf [0 2 -1 0 0 0 0] 1e-06;
    k               k [0 0 1 0 0 0 0] 0;
    n               n [0 0 0 0 0 0 0] 1;
}


TRef                TRef [0 0 0 1 0 0 0] 293;

// Laminar Prandtl number
Pr              Pr [0 0 0 0 0 0 0] 0.9;

// Turbulent Prandtl number
Prt             Prt [0 0 0 0 0 0 0] 1.2;

// Specific Heat Capacity
Cp		Cp [0 2 -2 -1 0 0 0] 1006.43;

// Thermal expansion coefficient
beta            beta [0 0 0 -1 0 0 0] 3e-03;

//Gravetational acceleration
g               g [0 1 -2 0 0 0 0] (0 0 -9.81);

//coriolis parameter
Omega           Omega [0 0 -1 0 0 0 0] $Omega;

//Omega           Omega[0 0 -1 0 0 0 0] (0 6.29407222422e-21 0.00010279);
Ug              Ug [0 1 -1 0 0 0 0] $Ug;

// ************************************************************************* //
