case/demo/generateBoundary/0/pd
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      pd;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    upperWall
    {
// 	type            zeroGradient;

	type		fixedValue;
	value		uniform 0;		

    }

    lowerWall
    {
	type		zeroGradient;
/*
	type		fixedFluxPressure;
	rho		rhok;
        value           uniform 0;
*/
    }

    #include    "../cyclicPatches"
}

// ************************************************************************* //
