case/demo/generateBoundary/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include 	"../../utilities/boundaryConditions"

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform $Ttop;

boundaryField
{
    lowerWall
    {
        type            fixedValue;
        value           uniform 293;
    }
    upperWall
    {
        type            fixedValue;
        value           uniform $Ttop;
    }
    #include    "../cyclicPatches"
}


// ************************************************************************* //
