case/demo/generateBoundary/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    #include		"../../utilities/boundaryConditions"
    lowerWall
    {
        type            nutkAtmRoughWallFunction;
        z0              $z0;
	value		uniform 0.0;
    }
    upperWall
    {
        type            zeroGradient;
    }

    #include    "../cyclicPatches"

}


// ************************************************************************* //
